[
    {
        "Id": "m2",
        "Name": "Baked Eggs over Sweet Potato",
        "description": "Easy eggs with herby, cheesy sweet potato",
        "Image": "https://www.chefbop.com/shared/EggsOverSweetPotato.jpeg",
        "Ingredients": [
            [
                "f4",
                8.0
            ],
            [
                "f5",
                0.25
            ],
            [
                "f6",
                2.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p6"
        ],
        "IncrementAmount": 2,
        "prepTime": 10,
        "cookTime": 40,
        "category": "Eggs",
        "instructions": [
            "Heat your oven to 425˚F. Give the sweet potato a good scrub and cut it into ½\" cubes.",
            "Place the following in a sheet pan: 1 cubed sweet potato, 2 tbsp of diced onions, 1 tbsp olive oil, season lightly with salt and pepper. Toss until well combined. Place in the oven and roast for 25 to 30 minutes.",
            "Take tray out of the oven, Make two mounds with a divit in each (bowl shape) out of the sweep potato cubes. Crack 1 egg into each divit (2 eggs). Return the pan to the oven and bake for another 10 minutes.",
            "Top with feta cheese."
        ]
    },
    {
        "Id": "m5",
        "Name": "Baked Eggs With Avocado and Feta",
        "description": "Delicious and healthy breakfast option",
        "Image": "https://www.chefbop.com/shared/EggsOverAvacado.jpeg",
        "Ingredients": [
            [
                "f6",
                4.0
            ],
            [
                "f17",
                1.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3"
        ],
        "IncrementAmount": 1,
        "category": "Eggs",
        "prepTime": 10,
        "cookTime": 15,
        "instructions": [
            "Preheat your oven to 450°F. Line a baking dish with foil for easy cleanup. ",
            "Cut the avocado in half lengthwise and remove the pit. Using a spoon, scoop out a little of each avocado half - you want the hole to be large enough to accommodate an egg.",
            "Season the avocado halves with salt and pepper, and place them in the prepared baking dish. ",
            "Break each egg into a bowl, then carefully slide the yolk, and as much as will fit from the white, into the center of each avocado half. (there will be some left over egg whites)",
            "Bake for 15 minutes.",
            "Season the avocado egg with more salt, black pepper, and feta cheese"
        ]
    },
    {
        "Id": "m3",
        "Name": "Oven Baked Burgers",
        "description": "Easiest way to cook burgers",
        "Image": "https://www.chefbop.com/shared/Burger.jpeg",
        "Ingredients": [
            [
                "f7",
                1.0
            ],
            [
                "f8",
                1.0
            ],
            [
                "f9",
                1.0
            ],
            [
                "f28",
                0.2
            ],
            [
                "f29",
                0.1
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p5"
        ],
        "IncrementAmount": 2,
        "category": "Beef",
        "instructions": [
            "Preheat your oven to 425°F. Line a baking sheet with aluminum foil",
            "Season the upward-facing side of your patties (cook 1-6 patties as desired), then place them onto your prepared baking sheet seasoned side down. Leave some space between the patties for even cooking, then season the remaining side of your burgers.",
            "Place in the center rack of your preheated oven and cook the burgers for 25 minutes.",
            "(Optional) Put a slice of cheese on each burger and return to the oven for 1-2 minutes.",
            "Remove from the oven and assemble burgers."
        ],
        "prepTime": 5,
        "cookTime": 25
    },
    {
        "Id": "m6",
        "Name": "Sheet Pan Steak Fajitas",
        "description": "5 minute fiesta!!!",
        "Image": "https://www.chefbop.com/shared/Fajita.jpeg",
        "Ingredients": [
            [
                "f22",
                0.25
            ],
            [
                "f23",
                1.0
            ],
            [
                "f24",
                0.3
            ],
            [
                "f25",
                4.0
            ],
            [
                "f26",
                3.0
            ]
        ],
        "OneTimes": [
            "p6",
            "p11"
        ],
        "IncrementAmount": 2,
        "category": "Beef",
        "instructions": [
        "Preheat oven to 400°F and line baking sheet with tin foil."

        ,"In a large zip-lock bag, add 1/4 lb of steak strips and drizzle with 1 tablespoon of olive oil, Sprinkle with 1 tbsp fajita seasoning. Toss to coat well."
        
        
        ,"Spread the vegetables in an even layer on prepared sheet pan. Try not to overlap too much and keep everything in a single layer. Drizzle with 1 1/2 tablespoons olive oil and season with 1/2 tablespoon of fajita seasonings. Toss to coat well."
        
        ,"Bake in preheated oven for 10-15 minutes."

        ,"Remove sheet pan from oven, mix and push the vegetables to the sides of the pan. Add steak strips in a single layer to the center of the pan, making sure not to overcrowd the pan. Broil on high for 5 minutes or until desired doneness."
        
        ,"Serve with tortillas, cheese, and sour cream."
        ],
        "prepTime": 5,
        "cookTime": 20
    },
    {
        "Id": "m7",
        "Name": "Chicken Parm",
        "description": "Easy Chicken dish",
        "Image": "https://www.chefbop.com/shared/Chicken.jpeg",
        "Ingredients": [
            [
                "f27",
                3.0
            ],
            [
                "f25",
                3.0
            ],
            [
                "f24",
                0.3
            ]
        ],
        "OneTimes": [
            "p12"
        ],
        "IncrementAmount": 2,
        "category": "Chicken",
        "instructions": [
            "Preheat oven to 375°F and line a baking pan with tin foil",
            "Seperate chicken throughout the pan",
            "dolop each chicken tender with spoon full of sour cream and spread",
            "sprinkle cheese and breadcrumbs on each chicken tender"
        ],
        "prepTime": 5,
        "cookTime": 15
    }

]