[
    {
        "Id": "m2",
        "Name": "Baked Eggs over Sweet Potato",
        "description": "Easy eggs with herby, cheesy sweet potato",
        "Recipe": "https://naturallyella.com/sweet-potatoes-baked-eggs/",
        "Image": "https://naturallyella.com/wp-content/uploads/2012/11/sweet_potato_baked_eggs.jpg",
        "Ingredients": [
            [
                "f4",
                1.0
            ],
            [
                "f5",
                0.25
            ],
            [
                "f6",
                2.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p6",
            "p7",
            "p8"
        ],
        "IncrementAmount": 2,
        "prepTime": 10,
        "cookTime": 40,
        "category": "Eggs",
        "instructions": [
            "Heat your oven to 425˚F and have a 8x8 (or similar-sized) baking dish ready. Give the sweet potato a good scrub and cut it into ½\" cubes. Mince a quarter of the shallot.",
            "Place the following in the pan: sweet potato, shallot, olive oil, herbs, and salt. Toss until well combined. Place in the oven and roast for 25 to 30 minutes.",
            "Once the sweet potatoes are mostly tender, create two wells and crack in the eggs. Return the pan to the oven and bake for another 8 to 10 minutes, until the whites are set and the yolks are to your desired doneness.",
            "Top with cheese and crushed red pepper if desired."
        ]
    },
    {
        "Id": "m5",
        "Name": "Baked Eggs With Avocado and Feta",
        "description": "Delicious and healthy breakfast option",
        "Recipe": "https://kalynskitchen.com/low-carb-baked-eggs-with-avocado-feta/",
        "Image": "https://d1yfn1dfres2va.cloudfront.net/005/18/ee/18eeb14d30ed57ac996ef1079f9dee73_640m.jpg",
        "Ingredients": [
            [
                "f6",
                4.0
            ],
            [
                "f17",
                1.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3"
        ],
        "IncrementAmount": 1,
        "category": "Eggs",
        "prepTime": 25,
        "cookTime": 15,
        "instructions": [
            "Break eggs into individual ramekins and let the eggs and avocado come to room temperature for 15 minutes.",
            "Set the oven to 400F/200C, then put the gratin dishes on a baking sheet and heat them in the oven for 10 minutes.",
            "After 15 minutes, peel the avocado and cut each half into 6 slices.",
            "Remove gratin dishes from the oven and spray with olive oil or non-stick spray.",
            "Arrange the sliced avocados in each dish and VERY CAREFULLY tip two eggs into each dish.",
            "Sprinkle with crumbled Feta and season to taste with salt and fresh-ground black pepper. (Remember that Feta is salty; we didn’t use much salt.)",
            "Bake 12-15 minutes or less, until the whites are set and the egg yolks are done to your liking.",
            "Serve hot. Add tabasco sauce or serve with whole wheat toast for extra carbs."
        ]
    },
    {
        "Id": "m3",
        "Name": "Oven Baked Burgers",
        "description": "Fast, easy classic crowd pleaser",
        "Recipe": "https://bakeitwithlove.com/frozen-hamburgers-in-the-oven/?msclkid=cadb3c92ac9411ec93b9a180196c1f87",
        "Image": "https://bakeitwithlove.com/wp-content/uploads/2021/10/Frozen-Hamburgers-In-The-Oven-sq.jpg",
        "Ingredients": [
            [
                "f7",
                1.0
            ],
            [
                "f8",
                1.0
            ],
            [
                "f9",
                1.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p5"
        ],
        "IncrementAmount": 2,
        "category": "Beef",
        "instructions": [
            "Preheat your oven to 425°F (218°C) and spray or lightly grease a wire cooling rack with non-stick cooking spray. Line a rimmed baking sheet with parchment paper or aluminum foil then place the rack onto your baking sheet.",
            "Season the upward-facing side of your patties, then place them onto your prepared wire rack with the seasoned side facing downward. Leave some space between the patties for even cooking, then season the remaining side of your burgers.",
            "Place in the center rack of your preheated oven and cook the burgers for 25 minutes. Flipping them after the patties have cooked for 15 minutes is optional (but I like to do this).",
            "(Optional) Top each patty with a slice of cheese and return to the oven for 1-2 minutes until melted. You can also toast the buns on a lower oven rack while melting the cheese.",
            "Remove from the oven when done and assemble burgers with your favorite toppings and condiments."
        ],
        "prepTime": 5,
        "cookTime": 25
    }
]