[
    {
        "Id": "m2",
        "Name": "Baked Eggs over Sweet Potato",
        "description": "Easy eggs with herby, cheesy sweet potato",
        "Recipe": "https://naturallyella.com/sweet-potatoes-baked-eggs/",
        "Image": "https://naturallyella.com/wp-content/uploads/2012/11/sweet_potato_baked_eggs.jpg",
        "Ingredients": [
            [
                "f4",
                1.0
            ],
            [
                "f5",
                0.25
            ],
            [
                "f6",
                2.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p6"
        ],
        "IncrementAmount": 2,
        "prepTime": 10,
        "cookTime": 40,
        "category": "Eggs",
        "instructions": [
            "Heat your oven to 425˚F. Give the sweet potato a good scrub and cut it into ½\" cubes.",
            "Place the following in a sheet pan: 1 cubed sweet potato, 2 tbsp of diced onions, 1 tbsp olive oil, season lightly with salt and pepper. Toss until well combined. Place in the oven and roast for 25 to 30 minutes.",
            "Once the sweet potatoes are mostly tender, create two wells and crack in 2 eggs. Return the pan to the oven and bake for another 8 to 10 minutes, until the whites are set and the yolks are to your desired doneness.",
            "Top with feta cheese."
        ]
    },
    {
        "Id": "m5",
        "Name": "Baked Eggs With Avocado and Feta",
        "description": "Delicious and healthy breakfast option",
        "Recipe": "https://healthyrecipesblogs.com/eggs-baked-in-avocado/",
        "Image": "https://healthyrecipesblogs.com/wp-content/uploads/2023/10/avocado-egg-2-2023.jpg",
        "Ingredients": [
            [
                "f6",
                4.0
            ],
            [
                "f17",
                1.0
            ],
            [
                "f16",
                2.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3"
        ],
        "IncrementAmount": 1,
        "category": "Eggs",
        "prepTime": 10,
        "cookTime": 15,
        "instructions": [
            "Preheat your oven to 450°F. Line a baking dish with foil for easy cleanup. ",
            "Cut the avocado in half lengthwise and remove the pit. Using a spoon, scoop out a little of the flesh of each avocado half - you want it to be large enough to accommodate a medium egg.",
            "Season the avocado halves with half of the salt and pepper, and place them in the prepared baking dish. ",
            "Break each egg into a small bowl, then carefully slide the yolk, and as much as will fit from the white, into the center of each avocado half. (there will be some left over egg whites)",
            "Bake until the whites are set, for about 15 minutes. ",
            "Season the avocado egg with more salt, black pepper, and feta cheese"
        ]
    },
    {
        "Id": "m3",
        "Name": "Oven Baked Burgers",
        "description": "Fast, easy classic crowd pleaser",
        "Recipe": "https://bakeitwithlove.com/frozen-hamburgers-in-the-oven/?msclkid=cadb3c92ac9411ec93b9a180196c1f87",
        "Image": "https://bakeitwithlove.com/wp-content/uploads/2021/10/Frozen-Hamburgers-In-The-Oven-sq.jpg",
        "Ingredients": [
            [
                "f7",
                1.0
            ],
            [
                "f8",
                1.0
            ],
            [
                "f9",
                1.0
            ]
        ],
        "OneTimes": [
            "p2",
            "p3",
            "p5"
        ],
        "IncrementAmount": 2,
        "category": "Beef",
        "instructions": [
            "Preheat your oven to 425. Line a baking sheet with aluminum foil",
            "Season the upward-facing side of your patties, then place them onto your prepared baking sheet seasoned side down. Leave some space between the patties for even cooking, then season the remaining side of your burgers.",
            "Place in the center rack of your preheated oven and cook the burgers for 25 minutes.",
            "(Optional) Top each patty with a slice of cheese and return to the oven for 1-2 minutes until melted. You can also toast the buns on a lower oven rack while melting the cheese.",
            "Remove from the oven when done and assemble burgers with your favorite toppings and condiments."
        ],
        "prepTime": 5,
        "cookTime": 25
    },
    {
        "Id": "m6",
        "Name": "Sheet Pan Steak Fajitas",
        "description": "5 minute take on clasic mexican dish",
        "Recipe": "https://lifemadesweeter.com/sheet-pan-steak-fajitas/",
        "Image": "https://lifemadesweeter.com/wp-content/uploads/Sheet-Pan-Steak-Fajitas-Recipe-Photo-Picture3-300x300.jpg",
        "Ingredients": [
            [
                "f22",
                0.25
            ],
            [
                "f23",
                1.0
            ],
            [
                "f24",
                0.3
            ],
            [
                "f25",
                4.0
            ],
            [
                "f26",
                3.0
            ]
        ],
        "OneTimes": [
            "p6",
            "p11"
        ],
        "IncrementAmount": 2,
        "category": "Beef",
        "instructions": [
        "Preheat oven to 400 degrees and grease a large baking sheet. For easier cleanup, you can also line with parchment paper or foil."

        ,"In a large zip-lock bag, add 1/4 lb of steak strips and drizzle with 1 tablespoons olive oil, Sprinkle with 1 tbsp fajita seasoning. Toss to coat well."
        
        
        ,"Spread the vegetables in an even layer on prepared sheet pan. Try not to overlap too much and keep everything in a single layer. Drizzle with 1 1/2 tablespoons olive oil and season with remaining one third (1/3) of the seasonings. Toss to coat well."
        
        ,"Bake in preheated oven for 10-15 minutes (depending on how done you like your vegetables) or until peppers are tender. ."
        ,"Remove sheet pan from oven, flip and push the vegetables to the sides of the pan. Add steak strips in a single layer to the center of the pan, making sure not to overcrowd the pan. Broil on high for 3 minutes or until desired doneness (flip as needed)."
        
        ,"Serve with tortillas, cheese, and sour cream."
        ],
        "prepTime": 5,
        "cookTime": 20
    },
    {
        "Id": "m7",
        "Name": "Chicken Parm",
        "description": "Easy Chicken dish",
        "Recipe": "https://lifemadesweeter.com/sheet-pan-steak-fajitas/",
        "Image": "https://lifemadesweeter.com/wp-content/uploads/Sheet-Pan-Steak-Fajitas-Recipe-Photo-Picture3-300x300.jpg",
        "Ingredients": [
            [
                "f27",
                3.0
            ],
            [
                "f25",
                3.0
            ],
            [
                "f24",
                0.3
            ]
        ],
        "OneTimes": [
            "p12"
        ],
        "IncrementAmount": 2,
        "category": "Chicken",
        "instructions": [
            "Preheat oven to 375 degrees and line a baking pan with tin foil",
            "Seperate chicken throughout the pan",
            "dolop each chicken tender with spoon full of sour cream and spread",
            "sprinkle cheese and breadcrumbs on each chicken tender"
        ],
        "prepTime": 5,
        "cookTime": 15
    }

]